// 1. Запросите у пользователя его имя и выведите в ответ:
// «Привет, его имя!».

// ---------------------------------------------------------
// const namee = prompt("Как тебя зовут?");

// alert("Привет, " + namee);
// ---------------------------------------------------------



// 2. Запросите у пользователя год его рождения, посчитайте,
// сколько ему лет и выведите результат. Текущий год укажите
// в коде как константу

// ---------------------------------------------------------
// const years = prompt("В каком году вы родились?");
// const year_now = 2022;
// const result =  year_now - years;
// alert("Ваш возраст: "result);
// ---------------------------------------------------------



// 3. Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата

// ---------------------------------------------------------
// const side = prompt("Длина стороны квадрата: ");
// const result = side * 4;
// alert("Периметр квадрата: " + result);
// ---------------------------------------------------------



// 4. Запросите у пользователя радиус окружности и выведите
// площадь такой окружности.

// ---------------------------------------------------------
// const radius = prompt("Введите радиус окружности: ");
// const pi = 3.14;
// const result = pi * (radius * radius);
// alert("Площадь окружности: " + result);
// ---------------------------------------------------------



// 5. Запросите у пользователя расстояние в км между двумя
// городами и за сколько часов он хочет добраться. Посчитайте скорость, с которой необходимо двигаться, чтобы
// успеть вовремя.

// ---------------------------------------------------------
// const distance = prompt("Расстояние в км: ");
// const hours = prompt("За сколько часов хотите добраться: ");
// const result = distance / hours;
// alert("Необходимая скорость: " + result + "km/h");
// ---------------------------------------------------------